app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "New article through web"], ["body", "testing"], ["created_at", "2016-05-19 23:31:07.058522"], ["updated_at", "2016-05-19 23:31:07.058522"]]
---
  def create
    @article = Article.new(article_params)
    @article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "articles" SET "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["body", "testing, testing new update/save"], ["updated_at", "2016-05-19 23:36:03.373151"], ["id", 6]]
---
  def update
    @article = Article.find(params[:id])
    @article.update(article_params)