app/controllers/tags_controller.rb

  def show
    @tag = Tag.find(params[:id])
---
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT 1  [["id", 3]]

  def index
    @tag = Tag.all
---
SELECT "tags".* FROM "tags"